## Data_Frames(a)

In [48]:
import numpy as np

In [49]:
import pandas as pd

In [50]:
from numpy.random import randn

In [51]:
np.random.seed(101)

In [52]:
df = pd.DataFrame(randn(5,6),['A','B','C','D','E'], ['W','X','Y','Z','A','B'])

In [53]:
df

          W         X         Y         Z         A         B
A  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
B -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
C  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
D  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119
E -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960

In [54]:
df['Z']

A    0.503826
B    0.740122
C    0.955057
D    1.693723
E    0.184502
Name: Z, dtype: float64

In [55]:
type(df['Y'])

pandas.core.series.Series

In [56]:
df.Y

A    0.907969
B   -2.018168
C   -0.933237
D    0.302665
E    0.166905
Name: Y, dtype: float64

In [57]:
df['new'] = df['W'] + df['Y']

In [58]:
df

          W         X         Y         Z         A         B       new
A  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318  3.614819
B -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001 -2.866245
C  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757 -0.744542
D  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119  2.908633
E -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960  0.032064

In [59]:
df.drop('new', axis = 1, inplace=True)

In [60]:
df

          W         X         Y         Z         A         B
A  2.706850  0.628133  0.907969  0.503826  0.651118 -0.319318
B -0.848077  0.605965 -2.018168  0.740122  0.528813 -0.589001
C  0.188695 -0.758872 -0.933237  0.955057  0.190794  1.978757
D  2.605967  0.683509  0.302665  1.693723 -1.706086 -1.159119
E -0.134841  0.390528  0.166905  0.184502  0.807706  0.072960

In [61]:
df.drop('W', axis = 1, inplace=True)

In [62]:
df

          X         Y         Z         A         B
A  0.628133  0.907969  0.503826  0.651118 -0.319318
B  0.605965 -2.018168  0.740122  0.528813 -0.589001
C -0.758872 -0.933237  0.955057  0.190794  1.978757
D  0.683509  0.302665  1.693723 -1.706086 -1.159119
E  0.390528  0.166905  0.184502  0.807706  0.072960

In [63]:
df.drop('E', axis = 0, inplace=True)

In [64]:
df

          X         Y         Z         A         B
A  0.628133  0.907969  0.503826  0.651118 -0.319318
B  0.605965 -2.018168  0.740122  0.528813 -0.589001
C -0.758872 -0.933237  0.955057  0.190794  1.978757
D  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [66]:
df.drop('D')

          X         Y         Z         A         B
A  0.628133  0.907969  0.503826  0.651118 -0.319318
B  0.605965 -2.018168  0.740122  0.528813 -0.589001
C -0.758872 -0.933237  0.955057  0.190794  1.978757

In [67]:
df.shape

(4, 5)

In [68]:
df

          X         Y         Z         A         B
A  0.628133  0.907969  0.503826  0.651118 -0.319318
B  0.605965 -2.018168  0.740122  0.528813 -0.589001
C -0.758872 -0.933237  0.955057  0.190794  1.978757
D  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [73]:
df[['Y','X']]

          Y         X
A  0.907969  0.628133
B -2.018168  0.605965
C -0.933237 -0.758872
D  0.302665  0.683509

In [74]:
df.loc['A']

X    0.628133
Y    0.907969
Z    0.503826
A    0.651118
B   -0.319318
Name: A, dtype: float64

In [76]:
df.iloc[2]

X   -0.758872
Y   -0.933237
Z    0.955057
A    0.190794
B    1.978757
Name: C, dtype: float64

In [77]:
df.loc[['A','B']]

          X         Y         Z         A         B
A  0.628133  0.907969  0.503826  0.651118 -0.319318
B  0.605965 -2.018168  0.740122  0.528813 -0.589001

In [78]:
df.iloc[2,4]

1.9787573241128278

In [83]:
df.iloc[2:4]

          X         Y         Z         A         B
C -0.758872 -0.933237  0.955057  0.190794  1.978757
D  0.683509  0.302665  1.693723 -1.706086 -1.159119

In [85]:
df.loc[['A','B'],['Z','Y']]

          Z         Y
A  0.503826  0.907969
B  0.740122 -2.018168